# 3장 파이썬 기초

## 3.2 파이썬 프로그램 기초
### [1] 파이썬의 자료형

#### 1) 숫자형과 문자형

In [1]:
a = 123 
b = 'abc' 
print(type(a), type(b))

<class 'int'> <class 'str'>

#### 2) 리스트, 튜플, 딕셔너리

In [2]:
#리스트 생성
List = ['a', 'b', 'c', 'd']

#튜플 생성
Tuple = (1, 2, 3, 4)  

#딕셔너리 생성
Dic = {'경기도':'일산', '강원도':'원주', '충청도':'천안', '전라도':'전주'}  

print(type(List), type(Tuple), type(Dic))

<class 'list'> <class 'tuple'> <class 'dict'>

### [2] 파이썬 제어문
#### 1) if 문

In [3]:
point = 20
if point >= 60:
    print('vip')
else:
    print('member')

member

#### 2) for 문

In [4]:
for a in [1, 2, 3, 4, 5]: 
    print(a)

1
2
3
4
5

In [5]:
for b in range(1, 10, 2): 
    print(b)

1
3
5
7
9

#### 3) while 문

In [6]:
#1. 초기화
customer_count = 0  
sum1 = 0   

print('customer_count sum')

#2. 조건 검사
while (sum1 < 20):  
    customer_count = customer_count + 1 
    sum1 = sum1 + customer_count  
    print(customer_count, sum1)

customer_count sum
1 1
2 3
3 6
4 10
5 15
6 21

## 3.3 데이터 분석을 위한 파이썬 라이브러리
### [1] 통계분석을 위한 라이브러리

In [34]:
import pandas as pd

In [35]:
from matplotlib import pyplot as plt

In [36]:
from pandas import DataFrame

### [2] NumPy
#### 1) 배열 생성하기

In [8]:
import numpy as np
data1 = [0, 1, 2, 3, 4 ,5]
a1 = np.array(data1) 
a1

array([0, 1, 2, 3, 4, 5])

In [9]:
a1.dtype

dtype('int32')

In [10]:
#1. 1부터 10까지 범위 안에서 간격 2를 갖는 배열 생성
a1 = np.arange(start = 1, stop = 10, step =2)
print(a1)

#2. 0부터 10까지 범위 안에서 간격 1을 갖는 배열 생성
a2= np.arange(10)
print(a2)

[1 3 5 7 9]
[0 1 2 3 4 5 6 7 8 9]

#### 2) 배열 연산하기

In [11]:
import numpy as np

arr1 = np.array([10, 15, 20, 30]) 
arr2 = np.array([1, 1, 2, 3])

print('----------덧셈----------')
print(arr1+arr2)
print('----------뺄셈----------')
print(arr1-arr2)
print('----------곱셈----------')
print(arr1*arr2)
print('----------나눗셈--------')
print(arr1/arr2)

----------덧셈----------
[11 16 22 33]
----------뺄셈----------
[ 9 14 18 27]
----------곱셈----------
[10 15 40 90]
----------나눗셈--------
[10. 15. 10. 10.]

#### 3) 배열의 인덱싱과 슬라이싱

* 인덱싱 (Indexing)

In [12]:
import numpy as np

a1 = np.array([0, 10, 20, 30, 40, 50])
a1

array([ 0, 10, 20, 30, 40, 50])

In [13]:
a1[4]

40

In [14]:
a1[5] = 70 
a1

array([ 0, 10, 20, 30, 40, 70])

In [15]:
a1[[1,3,4]]

array([10, 30, 40])

* 슬라이싱 (Slicing)

In [16]:
import numpy as np

b1 = np.array([0, 1, 2, 3, 4, 5])
b1

array([0, 1, 2, 3, 4, 5])

In [17]:
b1[1:4]

array([1, 2, 3])

In [18]:
b1[2:]

array([2, 3, 4, 5])

In [19]:
b1[2:5] = np.array([25, 35, 45])
b1

array([ 0,  1, 25, 35, 45,  5])

#### 4) 배열의 차원 변경하기

In [20]:
import numpy as np

Vector = np.arange(10)
Matrix = Vector.reshape(2,5)
Matrix

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [21]:
Vector = np.arange(10)
Matrix = Vector.reshape(-1 , 5)
Matrix

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

### [3] Pandas
#### 1) Pandas의 자료구조
* Series

In [22]:
import pandas as pd 

series = pd.Series([1, 2, 3, 4, 5])
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

* DataFrame

In [23]:
import pandas as pd
columns_list = ['고객이름', '나이', '등급']
value_list = [['원종호', 26, 'Silver'], ['김수현', 23, 'Gold'], ['김진표', 30, 'Vip']]
pd.DataFrame(data = value_list, columns = columns_list)

  고객이름  나이      등급
0  원종호  26  Silver
1  김수현  23    Gold
2  김진표  30     Vip

In [24]:
import pandas as pd

dict = {'고객이름' : ['원종호','김수현','김진표'], '나이' : [26,23,30], '등급' : ['Silver','Gold','Vip']} 
pd.DataFrame(data = dict)

  고객이름  나이      등급
0  원종호  26  Silver
1  김수현  23    Gold
2  김진표  30     Vip

#### 2) Pandas를 이용한 기초통계

In [25]:
import pandas as pd
 
sales_data = {'화장품':  [300, 274, 150, 524, 211],
              '의류': [773, 657, 699, 324, 487],
              '식음료': [362, 131, 593, 348, 98],
              '전자제품': [458, 667, 123, 521, 662]}
index_list = ['2014', '2015', '2016', '2017', '2018']

df_store = pd.DataFrame(data = sales_data, index = index_list)
df_store

      화장품   의류  식음료  전자제품
2014  300  773  362   458
2015  274  657  131   667
2016  150  699  593   123
2017  524  324  348   521
2018  211  487   98   662

In [26]:
#평균 출력
print(df_store.mean()) 

#표준편차 출력
print(df_store.std())

화장품     291.8
의류      588.0
식음료     306.4
전자제품    486.2
dtype: float64
화장품     142.246968
의류      181.110464
식음료     200.721947
전자제품    222.213186
dtype: float64

In [27]:
print((df_store.mean(axis=1)))

2014    473.25
2015    432.25
2016    391.25
2017    429.25
2018    364.50
dtype: float64

In [28]:
df_store.describe( )

              화장품          의류         식음료        전자제품
count    5.000000    5.000000    5.000000    5.000000
mean   291.800000  588.000000  306.400000  486.200000
std    142.246968  181.110464  200.721947  222.213186
min    150.000000  324.000000   98.000000  123.000000
25%    211.000000  487.000000  131.000000  458.000000
50%    274.000000  657.000000  348.000000  521.000000
75%    300.000000  699.000000  362.000000  662.000000
max    524.000000  773.000000  593.000000  667.000000

#### 3) DataFrame에서 원하는 데이터 추출

In [29]:
import pandas as pd
import numpy as np

dep_data = {'명동점': [59060, 49296, 62015, 48621, 46712, 31216, 38467],
            '분당점': [9312, 1267, 6893, 7226, 8878, 13622, 18228],
            '광주점': [2627, 4145, 4088, 4321, 4679, 4994, 5544],
            '부산점': [14211, 11071, 11234, 15424, 12146, 39415, 57866],
            '송도점': [np.nan,np.nan, 9912, 9224, 8395, 9786, 9667]}
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_store = pd.DataFrame(dep_data, index = index_list)
df_store

        명동점    분당점     송도점    부산점   광주점
2011  59060   9312     NaN  14211  2627
2012  49296   1267     NaN  11071  4145
2013  62015   6893  9912.0  11234  4088
2014  48621   7226  9224.0  15424  4321
2015  46712   8878  8395.0  12146  4679
2016  31216  13622  9786.0  39415  4994
2017  38467  18228  9667.0  57866  5544

In [30]:
df_store[0:2]

        명동점   분당점  송도점    부산점   광주점
2011  59060  9312  NaN  14211  2627
2012  49296  1267  NaN  11071  4145

In [31]:
df_store.loc['2016']

명동점    31216.0
분당점    13622.0
송도점     9786.0
부산점    39415.0
광주점     4994.0
Name: 2016, dtype: float64

In [32]:
df_store['명동점']

2011    59060
2012    49296
2013    62015
2014    48621
2015    46712
2016    31216
2017    38467
Name: 명동점, dtype: int64

In [33]:
df_store['명동점']['2013':'2015']

2013    62015
2014    48621
2015    46712
Name: 명동점, dtype: int64